results/raw/proxysql_ff_extended_tlsFalse_c64.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: extended
number of clients: 64
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1427394
number of failed transactions: 0 (0.000%)
latency average = 8.058 ms
latency stddev = 8.525 ms
initial connection time = 254.805 ms
tps = 7939.321128 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 7660.7 tps, lat 8.135 ms stddev 8.797, 0 failed
progress: 20.0 s, 8010.2 tps, lat 7.989 ms stddev 8.417, 0 failed
progress: 30.0 s, 8049.8 tps, lat 7.947 ms stddev 8.133, 0 failed
progress: 40.0 s, 7801.3 tps, lat 8.203 ms stddev 8.788, 0 failed
progress: 50.0 s, 7910.4 tps, lat 8.090 ms stddev 8.457, 0 failed
progress: 60.0 s, 8049.1 tps, lat 7.949 ms stddev 8.343, 0 failed
progress: 70.0 s, 8080.1 tps, lat 7.916 ms stddev 8.351, 0 failed
progress: 80.0 s, 7988.1 tps, lat 8.010 ms stddev 8.602, 0 failed
progress: 90.0 s, 7985.1 tps, lat 8.015 ms stddev 8.736, 0 failed
progress: 100.0 s, 7946.9 tps, lat 8.052 ms stddev 8.646, 0 failed
progress: 110.0 s, 7951.2 tps, lat 8.046 ms stddev 8.265, 0 failed
progress: 120.0 s, 7914.4 tps, lat 8.086 ms stddev 8.453, 0 failed
progress: 130.0 s, 7963.3 tps, lat 8.035 ms stddev 8.386, 0 failed
progress: 140.0 s, 7938.3 tps, lat 8.062 ms stddev 8.538, 0 failed
progress: 150.0 s, 7680.0 tps, lat 8.328 ms stddev 9.203, 0 failed
progress: 160.0 s, 7862.8 tps, lat 8.140 ms stddev 8.589, 0 failed
progress: 170.0 s, 7989.4 tps, lat 8.009 ms stddev 8.292, 0 failed
progress: 180.0 s, 7952.5 tps, lat 8.042 ms stddev 8.397, 0 failed