results/raw/proxysql_ff_extended_tlsTrue_c1.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: extended
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 112761
number of failed transactions: 0 (0.000%)
latency average = 1.596 ms
latency stddev = 0.393 ms
initial connection time = 15.224 ms
tps = 626.499163 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 566.7 tps, lat 1.762 ms stddev 0.410, 0 failed
progress: 20.0 s, 582.7 tps, lat 1.716 ms stddev 0.102, 0 failed
progress: 30.0 s, 576.5 tps, lat 1.734 ms stddev 0.104, 0 failed
progress: 40.0 s, 594.1 tps, lat 1.683 ms stddev 0.129, 0 failed
progress: 50.0 s, 689.2 tps, lat 1.451 ms stddev 0.128, 0 failed
progress: 60.0 s, 610.6 tps, lat 1.637 ms stddev 0.085, 0 failed
progress: 70.0 s, 531.1 tps, lat 1.882 ms stddev 0.445, 0 failed
progress: 80.0 s, 613.4 tps, lat 1.630 ms stddev 0.363, 0 failed
progress: 90.0 s, 741.1 tps, lat 1.349 ms stddev 0.057, 0 failed
progress: 100.0 s, 743.9 tps, lat 1.344 ms stddev 0.067, 0 failed
progress: 110.0 s, 728.5 tps, lat 1.372 ms stddev 0.094, 0 failed
progress: 120.0 s, 688.8 tps, lat 1.451 ms stddev 0.144, 0 failed
progress: 130.0 s, 740.9 tps, lat 1.349 ms stddev 0.062, 0 failed
progress: 140.0 s, 742.8 tps, lat 1.346 ms stddev 0.062, 0 failed
progress: 150.0 s, 667.9 tps, lat 1.497 ms stddev 0.297, 0 failed
progress: 160.0 s, 380.6 tps, lat 2.627 ms stddev 0.374, 0 failed
progress: 170.0 s, 364.4 tps, lat 2.744 ms stddev 0.233, 0 failed
progress: 180.0 s, 712.8 tps, lat 1.403 ms stddev 0.101, 0 failed