results/raw/proxysql_ff_extended_tlsTrue_c64.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: extended
number of clients: 64
number of threads: 16
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1219042
number of failed transactions: 0 (0.000%)
latency average = 9.434 ms
latency stddev = 9.576 ms
initial connection time = 275.268 ms
tps = 6781.218246 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 6604.6 tps, lat 9.416 ms stddev 9.381, 0 failed
progress: 20.0 s, 6824.4 tps, lat 9.375 ms stddev 9.709, 0 failed
progress: 30.0 s, 6603.8 tps, lat 9.688 ms stddev 9.673, 0 failed
progress: 40.0 s, 6806.4 tps, lat 9.402 ms stddev 9.379, 0 failed
progress: 50.0 s, 6812.8 tps, lat 9.392 ms stddev 9.700, 0 failed
progress: 60.0 s, 6920.0 tps, lat 9.246 ms stddev 9.107, 0 failed
progress: 70.0 s, 6842.7 tps, lat 9.350 ms stddev 9.498, 0 failed
progress: 80.0 s, 6833.8 tps, lat 9.362 ms stddev 9.540, 0 failed
progress: 90.0 s, 6815.9 tps, lat 9.382 ms stddev 9.484, 0 failed
progress: 100.0 s, 6737.1 tps, lat 9.503 ms stddev 9.919, 0 failed
progress: 110.0 s, 6797.6 tps, lat 9.412 ms stddev 9.826, 0 failed
progress: 120.0 s, 6857.6 tps, lat 9.334 ms stddev 9.330, 0 failed
progress: 130.0 s, 6857.4 tps, lat 9.330 ms stddev 9.358, 0 failed
progress: 140.0 s, 6785.9 tps, lat 9.427 ms stddev 9.325, 0 failed
progress: 150.0 s, 6677.2 tps, lat 9.578 ms stddev 9.849, 0 failed
progress: 160.0 s, 6627.3 tps, lat 9.660 ms stddev 9.551, 0 failed
progress: 170.0 s, 6708.6 tps, lat 9.538 ms stddev 9.812, 0 failed
progress: 180.0 s, 6785.8 tps, lat 9.419 ms stddev 9.790, 0 failed