results/raw/proxysql_ff_prepared_tlsFalse_c1.txt
pgbench (17.9 (Debian 17.9-1.pgdg13+1), server 16.1)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: prepared
number of clients: 1
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 170191
number of failed transactions: 0 (0.000%)
latency average = 1.057 ms
latency stddev = 0.206 ms
initial connection time = 11.683 ms
tps = 945.562867 (without initial connection time)

starting vacuum...end.
progress: 10.0 s, 1027.3 tps, lat 0.972 ms stddev 0.182, 0 failed
progress: 20.0 s, 1070.9 tps, lat 0.934 ms stddev 0.052, 0 failed
progress: 30.0 s, 975.0 tps, lat 1.025 ms stddev 0.126, 0 failed
progress: 40.0 s, 1032.4 tps, lat 0.968 ms stddev 0.082, 0 failed
progress: 50.0 s, 1023.3 tps, lat 0.977 ms stddev 0.056, 0 failed
progress: 60.0 s, 1051.8 tps, lat 0.951 ms stddev 0.052, 0 failed
progress: 70.0 s, 1048.8 tps, lat 0.953 ms stddev 0.053, 0 failed
progress: 80.0 s, 1018.5 tps, lat 0.982 ms stddev 0.141, 0 failed
progress: 90.0 s, 853.3 tps, lat 1.172 ms stddev 0.183, 0 failed
progress: 100.0 s, 793.3 tps, lat 1.260 ms stddev 0.191, 0 failed
progress: 110.0 s, 896.4 tps, lat 1.115 ms stddev 0.147, 0 failed
progress: 120.0 s, 674.5 tps, lat 1.482 ms stddev 0.112, 0 failed
progress: 130.0 s, 681.2 tps, lat 1.468 ms stddev 0.114, 0 failed
progress: 140.0 s, 679.8 tps, lat 1.470 ms stddev 0.119, 0 failed
progress: 150.0 s, 1050.5 tps, lat 0.952 ms stddev 0.064, 0 failed
progress: 160.0 s, 1059.7 tps, lat 0.943 ms stddev 0.051, 0 failed
progress: 170.0 s, 1056.1 tps, lat 0.947 ms stddev 0.051, 0 failed
progress: 180.0 s, 1026.2 tps, lat 0.974 ms stddev 0.058, 0 failed